#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//数组指针
//数组指针的定义 - 能够指向数组的指针
//整型指针:int* pint;能够指向整型数据的指针
//浮点型指针:float* pf;能够指向浮点型数据的指针

int main()
{
	int* p = NULL;  //p是整型指针 - 指向整型的指针 - 可以存放整型的地址
	char* pc = NULL;  //pc是字符指针 - 指向字符的指针 - 可以存放字符的地址
	//同理:数组指针 - 指向数组的指针 - 可以存放数组的地址
	
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	//arr - 首元素的地址
	//&arr[0] - 首元素的地址
	//&arr - 数组的地址
	int (*p)[10] = &arr; //数组的地址如何存储
	//此时的p就是数组指针,*表明p是指针,[10]表示指针指向数组,有10个元素,每个元素类型为int
	//要和数组指针做区分int* p[10]
	return 0;
}

//int* p1[10]  p1先和[10]结合,类型为int*,此时的p1为数组名
//int(*p2)[10]   p2先和*结合,表明p做指针,再和p[10]结合,表明p2指向的数组是10个元素的,每个元素的类型为int,此时的p2为指针

int main()
{
	char* arr[5];
	char* (*pa)[5] = &arr;
	return 0;
}

//&数组名和数组名
//对于一个数组int arr[10],arr是数组名,数组名表示数组首元素的地址
//而&数组名表示的是整个数组的地址,而不是数组首元素的地址
//数组首元素的地址+1,跳过一个元素的大小;而数组的地址+1,跳过整个数组的大小


//数组指针的使用
int main()
{
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	int(*pa)[10] = &arr;
	int i = 0;
	
	for (i = 0; i < 10; i++)
	{
		printf("%d ", (*pa)[i]);
	}

	for (i = 0; i < 10; i++)
	{
		printf("%d ", *(*pa+i));  //*pa == arr
	}

	return 0;
}

//二维数组指针

//参数是数组的形式
void print1(int arr[3][5], int x, int y)
{
	int i, j = 0;
	for (i = 0; i < x; i++)
	{
		for (j = 0; j < y; j++)
		{
			prinf("%d ", arr[i][j]);
		}
		printf("\n");
	}
	printf("\n");
}


//参数是数组指针的形式
void print2(int(*p)[5],int x,int y)  //此时的传参就可以用数组指针代替,传递的第一行元素的地址
{
	int i = 0;
	for (i = 0; i < x; i++)
	{
		int j = 0;
		for (j = 0; j < y; j++)
		{
			//两种形式都可以
			printf("%d ", *(*(p + i) + j)); // *(*(p + i) + j) == p[i][j]
			printf("%d ", (*(p + i))[j]);  //*（arr+i)  == *(p+i) == arr[i] == p[i]
		}
		printf("\n");
	}
}


int main()
{
	int arr[3][5] = { {1,2,3,4,5},{2,3,4,5,6},{3,4,5,6,7} };
	print1(arr, 3, 5); //arr - 数组名 - 首元素地址(但此处的首元素不是1)
	//讨论二维数组的首元素的时候,要先把二维数组想象成一维数组
	//此时的元素就为{1,2,3,4,5},{2,3,4,5,6},{3,4,5,6,7}三个元素
	//所以首元素就是第一行{1,2,3,4,5},而首元素地址就是{1,2,3,4,5}的地址
	//所以此时首元素地址传参要直接用数组名

	print2(arr, 3, 5);
	return 0;
}


//分析:
//int arr[5];  arr是一个5个元素的整型数组
//int* parr1[10];   parr1是一个数组,数组有10个元素,每个元素的类型是int*,parr1是指针数组
//int(*parr2)[10];   parr2是一个指针,该指针指向一个数组,数组有10个元素,每个元素的类型是int,parr2是数组指针
//int(*parr3[10])[5];   parr3是一个数组,该数组有10个元素,每个元素是一个数组指针,该数组指针指向的数组有5个元素,每个元素的类型是int